---
kind: type
id: T:Autodesk.Revit.DB.ExternallyTaggedNonBRep
source: html/c482cb3d-c4ae-3473-29e7-b9c2de3f2119.htm
---
# Autodesk.Revit.DB.ExternallyTaggedNonBRep

This class is used to create an externally tagged geometry object.

## Syntax (C#)
```csharp
public class ExternallyTaggedNonBRep : ExternallyTaggedGeometryObject
```